# Taps
tap "fluxcd/tap"
tap "siderolabs/tap"

# Core tools
brew "just"           # Task automation
brew "age"            # Encryption tool for SOPS
brew "gettext"        # Provides envsubst
brew "sops"           # Secret management
brew "direnv"         # Environment variable management

# Kubernetes tools
brew "kubectl"        # Kubernetes CLI
brew "fluxcd/tap/flux" # Flux CLI
brew "helm"           # Helm package manager
brew "kustomize"      # Kubernetes configuration management

# YAML tools
brew "yamllint"       # YAML linter
brew "yamlfmt"        # YAML formatter
brew "yq"             # YAML processor

# Optional but recommended
brew "jq"             # JSON processor
brew "ripgrep"        # Fast text search
brew "kubelogin"      # Kubernetes OIDC authentication

# Talos/Omni tools (if using)
brew "siderolabs/tap/talosctl"  # Talos CLI
brew "siderolabs/tap/omnictl"   # Omni CLI

# Casks
cask "1password-cli"  # Optional, for SOPS key management
